#+TITLE: Sample Page
#+FIRN_LAYOUT: sample-page
#+FIRN_PROPERTIES?: true
#+FIRN_ORDER: 12

* Example content

This is a sample page intended to demonstrate which org-elements are supported by Firn as well as to show different =render= functions being called. Everything before the heading "Render function examples" is automatically built by Firn, and can be styled by the user. Most colours, fonts, and spacing can be change in the CSS variables in =firn_base.css=



** Headings
*** TODO Heading with a keyword

Currently, =TODO= and =DONE= and rendered specifically in headlines. This will be improved to include user-input keywords in a future release.

*** Headings with a logbook
:LOGBOOK:
CLOCK: [2020-06-25 Thu 06:14]--[2020-06-25 Thu 07:45] =>  1:31
CLOCK: [2020-06-24 Wed 07:35]--[2020-06-24 Wed 08:18] =>  0:43
CLOCK: [2020-06-23 Tue 07:12]--[2020-06-23 Tue 07:49] =>  0:37
CLOCK: [2020-06-22 Mon 07:00]--[2020-06-22 Mon 08:40] =>  1:40
CLOCK: [2020-06-20 Sat 11:58]--[2020-06-20 Sat 12:15] =>  0:17
CLOCK: [2020-06-19 Fri 06:50]--[2020-06-19 Fri 07:46] =>  0:56
CLOCK: [2020-06-18 Thu 07:07]--[2020-06-18 Thu 07:54] =>  0:47
CLOCK: [2020-06-17 Wed 07:00]--[2020-06-17 Wed 07:59] =>  0:59
CLOCK: [2020-06-16 Tue 09:54]--[2020-06-16 Tue 10:50] =>  0:56
CLOCK: [2020-06-16 Tue 06:50]--[2020-06-16 Tue 07:52] =>  1:02
CLOCK: [2020-06-15 Mon 08:38]--[2020-06-15 Mon 08:58] =>  0:20
CLOCK: [2020-06-15 Mon 07:10]--[2020-06-15 Mon 07:55] =>  0:45
CLOCK: [2020-06-13 Sat 08:34]--[2020-06-13 Sat 08:45] =>  0:11
CLOCK: [2020-06-12 Fri 07:37]--[2020-06-12 Fri 08:00] =>  0:23
CLOCK: [2020-06-11 Thu 07:11]--[2020-06-11 Thu 08:05] =>  0:54
CLOCK: [2020-06-10 Wed 09:50]--[2020-06-10 Wed 10:35] =>  0:45
CLOCK: [2020-06-09 Tue 06:55]--[2020-06-09 Tue 07:51] =>  0:56
CLOCK: [2020-06-08 Mon 07:07]--[2020-06-08 Mon 08:29] =>  1:22
CLOCK: [2020-06-07 Sun 11:27]--[2020-06-07 Sun 12:10] =>  0:43
CLOCK: [2020-06-07 Sun 09:35]--[2020-06-07 Sun 09:55] =>  0:20
CLOCK: [2020-06-06 Sat 13:54]--[2020-06-06 Sat 14:13] =>  0:19
CLOCK: [2020-06-05 Fri 06:55]--[2020-06-05 Fri 07:56] =>  1:01
CLOCK: [2020-06-04 Thu 06:35]--[2020-06-04 Thu 07:45] =>  1:10
CLOCK: [2020-06-03 Wed 12:33]--[2020-06-03 Wed 13:00] =>  0:27
CLOCK: [2020-06-03 Wed 07:14]--[2020-06-03 Wed 08:20] =>  1:06
CLOCK: [2020-06-02 Tue 07:05]--[2020-06-02 Tue 07:44] =>  0:39
CLOCK: [2020-06-01 Mon 07:11]--[2020-06-01 Mon 07:50] =>  0:39
CLOCK: [2020-05-31 Sun 09:10]--[2020-05-31 Sun 09:45] =>  0:35
CLOCK: [2020-05-30 Sat 09:38]--[2020-05-30 Sat 10:00] =>  0:22
CLOCK: [2020-05-29 Fri 07:14]--[2020-05-29 Fri 07:48] =>  0:34
CLOCK: [2020-05-28 Thu 07:15]--[2020-05-28 Thu 07:55] =>  0:40
CLOCK: [2020-05-27 Wed 07:08]--[2020-05-27 Wed 07:55] =>  0:47
CLOCK: [2020-05-26 Tue 07:15]--[2020-05-26 Tue 08:00] =>  0:45
CLOCK: [2020-05-25 Mon 07:19]--[2020-05-25 Mon 07:50] =>  0:31
CLOCK: [2020-05-24 Sun 09:36]--[2020-05-24 Sun 10:29] =>  0:53
CLOCK: [2020-05-23 Sat 08:12]--[2020-05-23 Sat 09:05] =>  0:53
CLOCK: [2020-05-22 Fri 07:11]--[2020-05-22 Fri 08:01] =>  0:50
CLOCK: [2020-05-21 Thu 07:12]--[2020-05-21 Thu 07:51] =>  0:39
CLOCK: [2020-05-20 Wed 08:38]--[2020-05-20 Wed 09:08] =>  0:30
CLOCK: [2020-05-19 Tue 09:13]--[2020-05-19 Tue 10:05] =>  0:52
CLOCK: [2020-05-18 Mon 09:22]--[2020-05-18 Mon 10:05] =>  0:43
CLOCK: [2020-05-17 Sun 09:54]--[2020-05-17 Sun 10:21] =>  0:27
CLOCK: [2020-05-16 Sat 08:18]--[2020-05-16 Sat 09:30] =>  1:12
CLOCK: [2020-05-15 Fri 07:55]--[2020-05-15 Fri 08:50] =>  0:55
CLOCK: [2020-05-14 Thu 07:51]--[2020-05-14 Thu 08:56] =>  1:05
CLOCK: [2020-05-13 Wed 07:50]--[2020-05-13 Wed 08:31] =>  0:41
CLOCK: [2020-05-12 Tue 08:13]--[2020-05-12 Tue 08:50] =>  0:37
CLOCK: [2020-05-11 Mon 07:53]--[2020-05-11 Mon 09:02] =>  1:09
CLOCK: [2020-05-10 Sun 08:19]--[2020-05-10 Sun 09:00] =>  0:41
CLOCK: [2020-05-08 Fri 08:26]--[2020-05-08 Fri 09:34] =>  1:08
CLOCK: [2020-05-07 Thu 08:10]--[2020-05-07 Thu 08:55] =>  0:45
CLOCK: [2020-05-06 Wed 08:00]--[2020-05-06 Wed 08:40] =>  0:40
CLOCK: [2020-05-05 Tue 08:05]--[2020-05-05 Tue 09:05] =>  1:00
CLOCK: [2020-05-04 Mon 11:06]--[2020-05-04 Mon 11:46] =>  0:40
CLOCK: [2020-05-03 Sun 09:25]--[2020-05-03 Sun 10:10] =>  0:45
CLOCK: [2020-05-02 Sat 09:31]--[2020-05-02 Sat 10:30] =>  0:59
CLOCK: [2020-05-01 Fri 08:01]--[2020-05-01 Fri 08:56] =>  0:51
CLOCK: [2020-04-30 Thu 08:18]--[2020-04-30 Thu 09:20] =>  1:02
CLOCK: [2020-04-29 Wed 07:50]--[2020-04-29 Wed 09:20] =>  1:30
CLOCK: [2020-04-28 Tue 07:49]--[2020-04-28 Tue 08:38] =>  0:49
CLOCK: [2020-04-27 Mon 09:59]--[2020-04-27 Mon 10:35] =>  0:36
CLOCK: [2020-04-26 Sun 09:12]--[2020-04-26 Sun 10:12] =>  1:00
CLOCK: [2020-04-25 Sat 08:19]--[2020-04-25 Sat 09:36] =>  1:17
CLOCK: [2020-04-24 Fri 09:14]--[2020-04-24 Fri 10:10] =>  0:56
CLOCK: [2020-04-23 Thu 08:48]--[2020-04-23 Thu 10:00] =>  1:12
CLOCK: [2020-04-22 Wed 09:00]--[2020-04-22 Wed 10:16] =>  1:16
CLOCK: [2020-04-21 Tue 08:45]--[2020-04-21 Tue 09:40] =>  0:55
CLOCK: [2020-04-20 Mon 08:15]--[2020-04-20 Mon 09:00] =>  0:45
CLOCK: [2020-04-19 Sun 10:40]--[2020-04-19 Sun 11:43] =>  1:03
CLOCK: [2020-04-18 Sat 11:46]--[2020-04-18 Sat 12:32] =>  0:46
CLOCK: [2020-04-17 Fri 08:40]--[2020-04-17 Fri 09:30] =>  0:50
CLOCK: [2020-04-16 Thu 08:24]--[2020-04-16 Thu 09:08] =>  0:44
CLOCK: [2020-04-15 Wed 08:39]--[2020-04-15 Wed 09:09] =>  0:30
CLOCK: [2020-04-14 Tue 09:00]--[2020-04-14 Tue 09:39] =>  0:39
CLOCK: [2020-04-13 Mon 10:28]--[2020-04-13 Mon 11:07] =>  0:39
CLOCK: [2020-04-13 Mon 09:39]--[2020-04-13 Mon 10:04] =>  0:25
CLOCK: [2020-04-13 Mon 09:11]--[2020-04-13 Mon 09:36] =>  0:25
CLOCK: [2020-04-12 Sun 10:26]--[2020-04-12 Sun 10:51] =>  0:25
CLOCK: [2020-04-12 Sun 09:51]--[2020-04-12 Sun 10:16] =>  0:25
CLOCK: [2020-04-11 Sat 12:06]--[2020-04-11 Sat 12:31] =>  0:25
CLOCK: [2020-04-11 Sat 11:41]--[2020-04-11 Sat 12:06] =>  0:25
CLOCK: [2020-04-10 Fri 10:13]--[2020-04-10 Fri 10:38] =>  0:25
CLOCK: [2020-04-10 Fri 09:30]--[2020-04-10 Fri 09:55] =>  0:25
CLOCK: [2020-04-10 Fri 08:59]--[2020-04-10 Fri 09:24] =>  0:25
CLOCK: [2020-04-09 Thu 08:46]--[2020-04-09 Thu 09:11] =>  0:25
CLOCK: [2020-04-09 Thu 08:12]--[2020-04-09 Thu 08:37] =>  0:25
CLOCK: [2020-04-08 Wed 08:44]--[2020-04-08 Wed 09:09] =>  0:25
CLOCK: [2020-04-08 Wed 08:13]--[2020-04-08 Wed 08:38] =>  0:25
CLOCK: [2020-04-07 Tue 08:00]--[2020-04-07 Tue 09:15] =>  1:15
CLOCK: [2020-04-06 Mon 10:40]--[2020-04-06 Mon 11:30] =>  0:50
CLOCK: [2020-04-05 Sun 11:01]--[2020-04-05 Sun 11:57] =>  0:56
CLOCK: [2020-04-04 Sat 14:10]--[2020-04-04 Sat 15:15] =>  1:05
CLOCK: [2020-04-03 Fri 10:59]--[2020-04-03 Fri 11:22] =>  0:23
CLOCK: [2020-04-03 Fri 09:32]--[2020-04-03 Fri 10:25] =>  0:53
CLOCK: [2020-04-02 Thu 07:35]--[2020-04-02 Thu 09:15] =>  1:40
CLOCK: [2020-04-01 Wed 08:00]--[2020-04-01 Wed 09:53] =>  1:53
CLOCK: [2020-03-31 Tue 07:46]--[2020-03-31 Tue 08:52] =>  1:06
CLOCK: [2020-03-30 Mon 09:10]--[2020-03-30 Mon 10:39] =>  1:29
CLOCK: [2020-03-28 Sat 11:26]--[2020-03-28 Sat 12:15] =>  0:49
CLOCK: [2020-03-27 Fri 09:06]--[2020-03-27 Fri 09:45] =>  0:39
CLOCK: [2020-03-26 Thu 08:32]--[2020-03-26 Thu 09:25] =>  0:53
CLOCK: [2020-03-25 Wed 08:31]--[2020-03-25 Wed 09:10] =>  0:39
CLOCK: [2020-03-24 Tue 08:12]--[2020-03-24 Tue 08:45] =>  0:33
CLOCK: [2020-03-23 Mon 09:18]--[2020-03-23 Mon 09:45] =>  0:27
CLOCK: [2020-03-20 Fri 10:52]--[2020-03-20 Fri 11:20] =>  0:28
CLOCK: [2020-03-19 Thu 10:13]--[2020-03-19 Thu 10:20] =>  0:07
CLOCK: [2020-03-18 Wed 08:54]--[2020-03-18 Wed 09:28] =>  0:34
CLOCK: [2020-03-17 Tue 08:52]--[2020-03-17 Tue 09:20] =>  0:28
CLOCK: [2020-03-16 Mon 09:25]--[2020-03-16 Mon 10:05] =>  0:40
CLOCK: [2020-03-13 Fri 08:14]--[2020-03-13 Fri 08:39] =>  0:25
CLOCK: [2020-03-12 Thu 10:37]--[2020-03-12 Thu 11:16] =>  0:39
CLOCK: [2020-03-12 Thu 08:06]--[2020-03-12 Thu 08:13] =>  0:07
CLOCK: [2020-03-11 Wed 08:46]--[2020-03-11 Wed 09:08] =>  0:22
CLOCK: [2020-03-10 Tue 19:26]--[2020-03-10 Tue 19:52] =>  0:26
CLOCK: [2020-03-09 Mon 08:34]--[2020-03-09 Mon 08:59] =>  0:25
CLOCK: [2020-03-07 Sat 14:50]--[2020-03-07 Sat 15:10] =>  0:20
CLOCK: [2020-03-06 Fri 11:26]--[2020-03-06 Fri 12:10] =>  0:44
CLOCK: [2020-03-05 Thu 08:03]--[2020-03-05 Thu 08:40] =>  0:37
CLOCK: [2020-03-03 Tue 09:05]--[2020-03-03 Tue 09:24] =>  0:19
CLOCK: [2020-03-03 Tue 08:26]--[2020-03-03 Tue 08:52] =>  0:26
CLOCK: [2020-03-02 Mon 11:16]--[2020-03-02 Mon 11:45] =>  0:29
CLOCK: [2020-02-29 Sat 15:13]--[2020-02-29 Sat 15:29] =>  0:16
CLOCK: [2020-02-29 Sat 14:42]--[2020-02-29 Sat 14:55] =>  0:13
CLOCK: [2020-02-29 Sat 07:43]--[2020-02-29 Sat 08:05] =>  0:22
CLOCK: [2020-02-28 Fri 08:21]--[2020-02-28 Fri 09:30] =>  1:09
CLOCK: [2020-02-27 Thu 10:14]--[2020-02-27 Thu 10:40] =>  0:26
CLOCK: [2020-02-26 Wed 08:56]--[2020-02-26 Wed 09:22] =>  0:26
CLOCK: [2020-02-25 Tue 07:47]--[2020-02-25 Tue 08:30] =>  0:43
CLOCK: [2020-02-24 Mon 16:57]--[2020-02-24 Mon 17:24] =>  0:27
CLOCK: [2020-02-22 Sat 17:09]--[2020-02-22 Sat 17:31] =>  0:22
CLOCK: [2020-02-21 Fri 17:10]--[2020-02-21 Fri 17:40] =>  0:30
CLOCK: [2020-02-20 Thu 08:07]--[2020-02-20 Thu 08:35] =>  0:28
CLOCK: [2020-02-18 Tue 10:20]--[2020-02-18 Tue 10:35] =>  0:15
CLOCK: [2020-02-17 Mon 19:12]--[2020-02-17 Mon 20:00] =>  0:48
CLOCK: [2020-02-16 Sun 08:42]--[2020-02-16 Sun 09:30] =>  0:48
CLOCK: [2020-02-14 Fri 13:03]--[2020-02-14 Fri 13:22] =>  0:19
CLOCK: [2020-02-11 Tue 12:47]--[2020-02-11 Tue 13:14] =>  0:27
CLOCK: [2020-02-10 Mon 08:53]--[2020-02-10 Mon 09:23] =>  0:30
CLOCK: [2020-02-07 Fri 10:12]--[2020-02-07 Fri 10:43] =>  0:31
CLOCK: [2020-02-06 Thu 09:05]--[2020-02-06 Thu 09:17] =>  0:12
CLOCK: [2020-02-03 Mon 12:37]--[2020-02-03 Mon 13:02] =>  0:25
CLOCK: [2020-02-02 Sun 15:54]--[2020-02-02 Sun 16:21] =>  0:27
CLOCK: [2020-02-01 Sat 18:04]--[2020-02-01 Sat 18:43] =>  0:39
CLOCK: [2020-01-30 Thu 15:58]--[2020-01-30 Thu 16:30] =>  0:32
CLOCK: [2020-01-30 Thu 10:53]--[2020-01-30 Thu 11:17] =>  0:24
CLOCK: [2020-01-29 Wed 10:31]--[2020-01-29 Wed 10:52] =>  0:21
CLOCK: [2020-01-27 Mon 11:25]--[2020-01-27 Mon 12:17] =>  0:52
CLOCK: [2020-01-17 Fri 11:13]--[2020-01-17 Fri 11:38] =>  0:25
CLOCK: [2020-01-15 Wed 09:11]--[2020-01-15 Wed 11:24] =>  2:13
CLOCK: [2020-01-14 Tue 09:47]--[2020-01-14 Tue 10:38] =>  0:51
CLOCK: [2020-01-13 Mon 20:26]--[2020-01-13 Mon 21:04] =>  0:38
CLOCK: [2020-01-06 Mon 10:19]--[2020-01-06 Mon 10:50] =>  0:31
CLOCK: [2020-01-04 Sat 14:34]--[2020-01-04 Sat 15:14] =>  0:40
CLOCK: [2020-01-03 Fri 11:35]--[2020-01-03 Fri 12:03] =>  0:28
CLOCK: [2019-12-18 Wed 10:58]--[2019-12-18 Wed 11:25] =>  0:27
CLOCK: [2019-12-17 Tue 10:37]--[2019-12-17 Tue 11:00] =>  0:23
CLOCK: [2019-12-04 Wed 10:07]--[2019-12-04 Wed 10:36] =>  0:29
CLOCK: [2019-12-03 Tue 10:24]--[2019-12-03 Tue 10:44] =>  0:20
CLOCK: [2019-11-27 Wed 08:11]--[2019-11-27 Wed 08:43] =>  0:32
CLOCK: [2019-11-26 Tue 19:56]--[2019-11-26 Tue 20:36] =>  0:40
CLOCK: [2019-11-26 Tue 08:14]--[2019-11-26 Tue 08:38] =>  0:24
CLOCK: [2019-11-22 Fri 08:58]--[2019-11-22 Fri 09:12] =>  0:14
CLOCK: [2019-11-19 Tue 10:46]--[2019-11-19 Tue 11:06] =>  0:20
CLOCK: [2019-11-17 Sun 17:06]--[2019-11-17 Sun 17:36] =>  0:30
CLOCK: [2019-11-16 Sat 10:01]--[2019-11-16 Sat 10:19] =>  0:18
CLOCK: [2019-11-13 Wed 08:48]--[2019-11-13 Wed 09:23] =>  0:35
CLOCK: [2019-10-15 Tue 08:12]--[2019-10-15 Tue 09:35] =>  1:23
CLOCK: [2019-10-10 Thu 09:53]--[2019-10-10 Thu 10:15] =>  0:22
CLOCK: [2019-10-09 Wed 16:39]--[2019-10-09 Wed 17:06] =>  0:27
CLOCK: [2019-10-07 Mon 08:43]--[2019-10-07 Mon 09:07] =>  0:24
CLOCK: [2019-10-06 Sun 19:46]--[2019-10-06 Sun 19:55] =>  0:09
CLOCK: [2019-09-27 Fri 10:21]--[2019-09-27 Fri 10:34] =>  0:13
CLOCK: [2019-09-27 Fri 08:52]--[2019-09-27 Fri 09:34] =>  0:42
CLOCK: [2019-09-27 Fri 08:28]--[2019-09-27 Fri 08:52] =>  0:24
CLOCK: [2019-09-11 Wed 19:05]--[2019-09-11 Wed 20:00] =>  0:55
CLOCK: [2019-09-10 Tue 21:11]--[2019-09-10 Tue 21:31] =>  0:20
CLOCK: [2019-09-09 Mon 19:44]--[2019-09-09 Mon 21:23] =>  1:39
CLOCK: [2019-09-01 Sun 18:46]--[2019-09-01 Sun 19:22] =>  0:36
:END:
The Logbook is not rendered, but is collected when processed made available as data in your layouts. See the bottom of this document
*** DONE [#A] Heading with a priority.
CLOSED: [2020-06-25 Thu 10:45]
**** Headings Level Three, with Properties
:PROPERTIES:
:foo: bar
:baz: 20
:END:

A heading with properties can optionally render those properties, either by enabling this feature in the =config.edn= file, or in the in-buffer-setting.

***** [#A] An H4 heading with priority A
****** [#B] An H5 Heading with Priority B
******* [#C] An H6 Heading with Priority C

** Tables

Tables are converted into HTML tables:

| Name     | Area            |
|----------+-----------------|
| Arctic   | 14,056,000 km2  |
| Atlantic | 106,460,000 km2 |
| Indian   | 70,560,000 km2  |
| Pacific  | 165,250,000 km2 |
| Southern | 20, 330,000 km2 |

** TODO Tags                                                    :upcoming:

Tags are not yet supported, but will be developed soon.

** Org Dates

Org dates are rendered as plain text, but are provided with a css class ( =.firn-timestamp=  ) for optional styling: [2020-06-25 Thu] .

* Find and render me!
If you can see this, then the render function found this heading and rendered it and it's content.
